Tekla Open API Reference for Tekla Structures 2025
WeldMark.WeldMarkAttributes.ShowEdgeAround Property
 Gets or sets visibility of the weld mark edge/around property.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool ShowEdgeAround { get; set; }
Public Property ShowEdgeAround As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
WeldMark.WeldMarkAttributes Class
Tekla.Structures.Drawing Namespace